DELETE FROM class_grade;
DELETE FROM class_student;
DELETE FROM course;
DELETE FROM student;
DELETE FROM class;
DELETE FROM sys_users;
DELETE FROM user_passwords;

INSERT INTO student (no, name, gender, enrollment_date) VALUES
('230650101', '张三', 'M', '2023-09-01'), -- 23级065专业01班01号
('230650118', '李四', 'M', '2023-09-01'),
('230650235', '王五', 'F', '2023-09-01'),
('240720101', '赵六', 'M', '2024-09-01'), -- 24级072专业01班01号
('240720212', '钱七', 'F', '2024-09-01'),
('240720325', '孙八', 'M', '2024-09-01'),
('240721101', '周九', 'M', '2024-09-01'), -- 24级072专业11班01号
('240721205', '吴十', 'F', '2024-09-01');

INSERT INTO course (no, name, credit, hours) VALUES
('10055', '高等数学', 4.0, 64),
('10056', '大学英语', 3.0, 48),
('10057', '数据结构', 3.5, 56),
('10058', '操作系统', 3.0, 48),
('10059', '计算机网络', 2.5, 40);


INSERT INTO class (class_no, name, semester, location, cou_sn) VALUES
-- 高等数学（课程SN=20000）的两个班次
('10055-2023S1-01', '高等数学_01', '2023-2024-1', '教学楼A201', 20000),
('10055-2024S1-01', '高等数学_02', '2024-2025-1', '教学楼B105', 20000),
-- 大学英语（课程SN=20001）的班次
('10056-2024S1-01', '大学英语_01', '2024-2025-1', '外语楼302', 20001),
-- 数据结构（课程SN=20002）的班次
('10057-2023S2-01', '数据结构_01', '2023-2024-2', '计算机中心501', 20002);

INSERT INTO class_student (stu_sn, class_sn) VALUES
-- 高等数学_01班（班次sn=30000）的学生
(10000, 30000), -- 张三
(10001, 30000), -- 李四
(10002, 30000), -- 王五

-- 高等数学_02班（班次sn=30001）的学生
(10003, 30001), -- 赵六
(10004, 30001), -- 钱七

-- 大学英语_01班（班次sn=30002）的学生
(10003, 30002), -- 赵六
(10005, 30002), -- 孙八
(10006, 30002), -- 周九

-- 数据结构_01班（班次sn=30003）的学生
(10007, 30003); -- 吴十


INSERT INTO class_grade (stu_sn, class_sn, grade) VALUES
-- 高等数学_01班 2023级（班次sn=30000）
(10000, 30000, 85.5),  -- 张三
(10001, 30000, 92.0),  -- 李四
(10002, 30000, 78.5),  -- 王五
-- 高等数学_02班 2024级（班次sn=30001）
(10003, 30001, 88.0),  -- 赵六
(10004, 30001, NULL),  -- 钱七（未录入）
-- 大学英语_01班 2024级（班次sn=30002）
(10003, 30002, 76.5),  -- 赵六
(10005, 30002, 91.0),  -- 孙八
(10006, 30002, 82.5);  -- 周九


-- 添加默认教秘账户（密码已哈希）
INSERT INTO sys_users (username, real_name) VALUES 
('jiaomi_admin', '系统管理员');

INSERT INTO user_passwords (user_sn, hashed_password) VALUES
(90000, '$2a$12$v5D/e/Wwq69nnJ3mzLJrTeM/N1mEZ5fNT0mKMNTg8K3uvZWnT2N/G'); -- 密码：Admin@1234